# -*- truncate-lines: nil; org-confirm-babel-evaluate: nil -*-
#+startup: show3levels indent

** The Final Script

If you're reading this in emacs you should be able to put your point in this
code block and press ~C-c C-c~ to run it. You'll know it worked when a
~#+RESULTS:~ block appears below it. It might take a few seconds.

#+begin_src ruby :tangle process-health-export.rb :noweb yes :results output
  #!/usr/bin/env ruby

  ### WARNING: This file is generated by babel. Changes will be lost.

  <<load>>

  ### remove unwanted fields

  <<cleanup>>

  ### flatten complex keys

  <<flatten-complex-keys>>

  ### aggregate step count

  <<aggregate-step-count>>

  ### save and report

  <<save-and-report>>
#+end_src

#+RESULTS:
: Processed 59 workouts. File size reduced by 99.78%, from 108285564 to 240643 bytes
